# รับค่าคำ
word = raw_input()
# ประกาศค่าตัววิ่ง เอาไว้อิงอักษรตัวที่ i
i = 0
# ระหว่างที่ตัววิ่ง น้อยกว่าความยาวคำ
while(i<len(word)):
    # ให้ letter เท่ากับตัวอักษรตำแหน่งที่ตัววิ่งของคำ
    letter = word[i]
    # ประกาศตำแหน่งของตัวอักษรที่จะเช็ค ให้เริ่มเช็คที่ตัวที่ตัววิ่ง
    pos = i
    # ตัวแปรนี้เก็บจำนวนตัวอักษรที่เช็คแล้วว่าเหมือน
    consecutive = 0
    # ถ้าตัวที่วิ่งเช็ค ยังเหมือนกับตัวแรกที่เจอ
    while(pos < len(word) and letter == word[pos]):
        # เตรียมไปเช็คตัวต่อไป
        pos += 1
        # และเพิ่มจำนวนตัวที่เรานับได้ว่าติดกันไปหนึ่ง
        consecutive += 1
    # ออกมาถึงตรงนี้ปุ๊บ แปลว่าวนเสร็จแล้ว ตัวต่อไปไม่ใช่แล้ว ให้เตรียมแสดงค่าของตัวอักษร และจำนวนที่นับได้
    printtxt = letter + " " + str(consecutive)
    # แสดงค่า
    print printtxt,
    # เพราะตะกี้เราเช็คไปแล้ว consecutive ตัว ดังนั้นข้ามไปเช็คตัวที่ i+consecutive
    i += consecutive
